RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_gpio.h
/* check parameter of the GPIOx input/output direction                                                      */
#define IS_GPIO_DIR(x)       (((x) == GPIO_DIR_IN) || ((x) == GPIO_DIR_OUT))

/* check parameter of the EXTI source port                                                                  */
#define IS_AFIO_ESS(x)       (IS_AFIO_ESS1(x) || IS_AFIO_ESS2(x) || IS_AFIO_ESS3(x) || IS_AFIO_ESS4(x) || IS_AFIO_ESS5(x))

#define IS_AFIO_ESS1(x)      ((x == AFIO_ESS_PA) || (x == AFIO_ESS_PB))
#if (LIBCFG_GPIOC)
#define IS_AFIO_ESS2(x)      (x == AFIO_ESS_PC)
#else
#define IS_AFIO_ESS2(x)      (0)
#endif
#if (LIBCFG_GPIOD)
#define IS_AFIO_ESS3(x)      (x == AFIO_ESS_PD)
#else
#define IS_AFIO_ESS3(x)      (0)
#endif
#if (LIBCFG_GPIOE)
#define IS_AFIO_ESS4(x)      (x == AFIO_ESS_PE)
#else
#define IS_AFIO_ESS4(x)      (0)
#endif
#if (LIBCFG_GPIOF)
#define IS_AFIO_ESS5(x)      (x == AFIO_ESS_PF)
#else
#define IS_AFIO_ESS5(x)      (0)
#endif

/* check parameter of the EXTI channel                                                                      */
#if (LIBCFG_EXTI_8CH)
#define IS_AFIO_EXTI_CH(x)   ((x == AFIO_EXTI_CH_0)  || (x == AFIO_EXTI_CH_1)  || \
                              (x == AFIO_EXTI_CH_2)  || (x == AFIO_EXTI_CH_3)  || \
                              (x == AFIO_EXTI_CH_4)  || (x == AFIO_EXTI_CH_5)  || \
                              (x == AFIO_EXTI_CH_6)  || (x == AFIO_EXTI_CH_7))
#else
#define IS_AFIO_EXTI_CH(x)   ((x == AFIO_EXTI_CH_0)  || (x == AFIO_EXTI_CH_1)  || \
                              (x == AFIO_EXTI_CH_2)  || (x == AFIO_EXTI_CH_3)  || \
                              (x == AFIO_EXTI_CH_4)  || (x == AFIO_EXTI_CH_5)  || \
                              (x == AFIO_EXTI_CH_6)  || (x == AFIO_EXTI_CH_7)  || \
                              (x == AFIO_EXTI_CH_8)  || (x == AFIO_EXTI_CH_9)  || \
                              (x == AFIO_EXTI_CH_10) || (x == AFIO_EXTI_CH_11) || \
                              (x == AFIO_EXTI_CH_12) || (x == AFIO_EXTI_CH_13) || \
                              (x == AFIO_EXTI_CH_14) || (x == AFIO_EXTI_CH_15))
#endif

/* check parameter of the AFIO mode                                                                         */
#if (LIBCFG_AFIO_MODE_0_7)
#define IS_AFIO_MODE(x)      ((x == AFIO_MODE_DEFAULT) || (x == AFIO_MODE_1)  || \
                              (x == AFIO_MODE_2)       || (x == AFIO_MODE_3)  || \
                              (x == AFIO_MODE_4)       || (x == AFIO_MODE_5)  || \
                              (x == AFIO_MODE_6)       || (x == AFIO_MODE_7))
#else
#define IS_AFIO_MODE(x)      ((x == AFIO_MODE_DEFAULT) || (x == AFIO_MODE_1)  || \
                              (x == AFIO_MODE_2)       || (x == AFIO_MODE_3)  || \
                              (x == AFIO_MODE_4)       || (x == AFIO_MODE_5)  || \
                              (x == AFIO_MODE_6)       || (x == AFIO_MODE_7)  || \
                              (x == AFIO_MODE_8)       || (x == AFIO_MODE_9)  || \
                              (x == AFIO_MODE_10)      || (x == AFIO_MODE_11) || \
                              (x == AFIO_MODE_12)      || (x == AFIO_MODE_13) || \
                              (x == AFIO_MODE_14)      || (x == AFIO_MODE_15))
#endif
/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Functions GPIO exported functions
  * @{
  */

/* Prototype of related GPIO function                                                                       */
void GPIO_DeInit(HT_GPIO_TypeDef* HT_GPIOx);
void GPIO_DirectionConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, GPIO_DIR_Enum GPIO_DIR_INorOUT);
void GPIO_PullResistorConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, GPIO_PR_Enum GPIO_PR_x);
void GPIO_InputConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, ControlStatus Cmd);
void GPIO_DriveConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, GPIO_DV_Enum GPIO_DV_nMA);
void GPIO_OpenDrainConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, ControlStatus Cmd);
#if (LIBCFG_GPIO_SINK_CURRENT_ENHANCED)
void GPIO_SinkConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n, ControlStatus Cmd);
#endif
FlagStatus GPIO_ReadInBit(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n);
FlagStatus GPIO_ReadOutBit(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n);
u16 GPIO_ReadInData(HT_GPIO_TypeDef* HT_GPIOx);
u16 GPIO_ReadOutData(HT_GPIO_TypeDef* HT_GPIOx);
void GPIO_SetOutBits(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP);
void GPIO_ClearOutBits(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP);
void GPIO_WriteOutBits(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, FlagStatus Status);
void GPIO_WriteOutData(HT_GPIO_TypeDef* HT_GPIOx, u16 Data);
void GPIO_PinLock(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP);
bool GPIO_IsPortLocked(HT_GPIO_TypeDef* HT_GPIOx);
bool GPIO_IsPinLocked(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n);
#if (LIBCFG_GPIO_DISABLE_DEBUG_PORT)
void GPIO_DisableDebugPort(void);
#endif
u32 GPIO_GetID(HT_GPIO_TypeDef* HT_GPIOx);

/* Prototype of related AFIO function                                                                       */
void AFIO_DeInit(void);
void AFIO_GPxConfig(u32 GPIO_Px, u32 AFIO_PIN_n, AFIO_MODE_Enum AFIO_MODE_n);
void AFIO_EXTISourceConfig(u32 GPIO_PIN_NUM_n, u32 GPIO_Px);
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
